app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" ORDER BY created_at DESC
---
            def index
				users = User.order('created_at DESC');

INSERT INTO "users" ("name", "cpf", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "thales"], ["cpf", 318638538], ["created_at", "2021-11-17 20:36:26.856359"], ["updated_at", "2021-11-17 20:36:26.856359"]]
---
			def create
				user = User.new(user_params)
				if user.save

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "cpf" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "thales"], ["cpf", 318638538], ["updated_at", "2021-11-17 20:40:09.441989"], ["id", 2]]
---
			def update
				user = User.find(params[:id])
				if user.update(user_params)